In [1]:
#Importing Library Files

from sklearn import datasets
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn import linear_model
import pandas as pd

# Converting Dataset from CSV to DataFrame using 'Pandas'

In [2]:
df=pd.read_csv("experience.csv")                    #Getting the CSV file from Home by read_csv using pandas function            
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [3]:
df.shape                    #it defines the rows and columns of a dataset

(8, 4)

In [4]:
a=df.isnull().sum()          #it used to find the null values
a

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

# Using fillna to clear NaN in experience

In [5]:
df.experience=df.experience.fillna(0)              #to remove or generating a new value in places of nan

In [6]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    8.0                           9      50000
1         0.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

# Using 'Median function' to predict the Nan Value which Is approximately suitable

In [7]:
import math                 #it used to do mathematical calculations
median_test_score = math.floor(df['test_score(out of 10)'].median())      #by using this we can clear nan by finding the median of the column test_score
median_test_score

8

In [8]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(median_test_score)  #after that using the median value to clear nan
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    8.0                           9      50000
1         0.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [9]:
reg = linear_model.LinearRegression()                    #using linear regression in multiple variables
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression()

# Predicting the salary of a person using the given inputs.

In [10]:
reg.predict([[1,8,5]])        #prediction the salary of a person using 1 which is experience , 8 is test_score and 5 is interview_score

C:\Python\anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([46342.06695779])

In [11]:
reg.predict([[14,18,12]])

C:\Python\anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([116804.22125182])